nicolas-codemate/esp32-pixelcast/src/main.cpp
        // ---- Separator (y=31) ----
        drawSeparatorLine(31, dimGray);

        lastDrawnMinute = minutes;
        lastWeatherUpdate = weatherData.lastUpdate;
    }

    // ---- Forecast (y=33-63) - redrawn on full redraw or page change ----
    if (needsForecastRedraw) {
        dma_display->fillRect(0, 32, DISPLAY_WIDTH, 32, black);

        // Compute which forecast days to display on the current page
        uint8_t pageStart = forecastPage * FORECAST_COLUMNS;
        uint8_t displayCount = min((uint8_t)FORECAST_COLUMNS,
            (uint8_t)(weatherData.forecastCount - pageStart));

        for (int col = 0; col < displayCount; col++) {
            int forecastIndex = pageStart + col;

            // Dynamic centering based on number of columns on this page
            int16_t colCenter;
            if (displayCount == 1) {
                colCenter = 32;
            } else if (displayCount == 2) {
                colCenter = 16 + col * 32;
            } else {
                colCenter = 11 + col * 21;
            }

            // Day name (TomThumb baseline=39, glyphs y=34-38)
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(amber);
            int16_t dayNameWidth = strlen(weatherData.forecast[forecastIndex].dayName) * 4;
            dma_display->setCursor(colCenter - dayNameWidth / 2, 39);
            dma_display->print(weatherData.forecast[forecastIndex].dayName);

            // Forecast icon (8x8 native, y=41-48)
            const uint16_t* builtinForecastIcon = getBuiltinWeatherIcon(weatherData.forecast[forecastIndex].icon);
            if (builtinForecastIcon) {
                drawProgmemIcon(dma_display, builtinForecastIcon, colCenter - 4, 41, 1);
            } else {
                CachedIcon* forecastIcon = getIcon(weatherData.forecast[forecastIndex].icon);
                if (forecastIcon && forecastIcon->valid) {
                    drawIconAtScale(forecastIcon, colCenter - 4, 41, 1);
                }
            }

            // Min temp in blue (TomThumb baseline=56, glyphs y=51-55)
            char minStr[8];
            snprintf(minStr, sizeof(minStr), "%d", weatherData.forecast[forecastIndex].tempMin);
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(coldBlue);
            int16_t minWidth = strlen(minStr) * 4;
            dma_display->setCursor(colCenter - minWidth / 2, 56);
            dma_display->print(minStr);

            // Max temp in red (TomThumb baseline=63, glyphs y=58-62)
            char maxStr[8];
            snprintf(maxStr, sizeof(maxStr), "%d", weatherData.forecast[forecastIndex].tempMax);
            dma_display->setTextColor(warmRed);
            int16_t maxWidth = strlen(maxStr) * 4;
            dma_display->setCursor(colCenter - maxWidth / 2, 63);
            dma_display->print(maxStr);
        }

        // Page indicator squares (vertical, right edge, only if multiple pages)
        if (forecastPageCount > 1) {
            uint16_t activeDot = dma_display->color565(120, 60, 200);  // Dark violet
            int squareSize = 2;
            int gap = 1;
            int step = squareSize + gap;  // 3px per indicator
            int totalHeight = forecastPageCount * step - gap;
            int dotX = 61;               // 2px margin from right edge (x=63)
            int dotStartY = 61 - totalHeight + 1;  // Bottom-aligned, 2px margin from y=63
            for (int d = 0; d < forecastPageCount; d++) {
                uint16_t dotColor = (d == forecastPage) ? activeDot : dimGray;
                dma_display->fillRect(dotX, dotStartY + d * step, squareSize, squareSize, dotColor);
            }
        }
    }

    // ---- Clock (y=13-20) - redrawn every second ----
    // Clear only the clock region (y=11 to y=20) to avoid full-screen flicker
    dma_display->fillRect(0, 11, DISPLAY_WIDTH, 10, black);

    dma_display->setTextColor(mintGreen);

    // HH:MM in NULL font (5 chars * 6px = 30px)
    char hmStr[6];
    snprintf(hmStr, sizeof(hmStr), "%02d:%02d", hours, minutes);
    dma_display->setFont(NULL);
    dma_display->setTextSize(1);

    int16_t hmX = (DISPLAY_WIDTH - 30) / 2 - 6;  // Shift left for seconds
    dma_display->setCursor(hmX, 13);
    dma_display->print(hmStr);

    // Seconds in TomThumb (baseline=20, bottom-aligned with NULL font y=13+6=19)
    dma_display->setFont(&TomThumb);
    char secStr[4];
    snprintf(secStr, sizeof(secStr), ":%02d", seconds);
    dma_display->setCursor(hmX + 31, 20);
    dma_display->print(secStr);

    // Reset font
    dma_display->setFont(NULL);

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowApp(AppItem* app) {
    if (!app) return;

    // Handle system apps
    if (strcmp(app->id, "clock") == 0) {
        displayShowTime();
        return;
    }

    if (strcmp(app->id, "date") == 0) {
        displayShowDate();
        return;
    }

    if (strcmp(app->id, "weatherclock") == 0) {
        displayShowWeatherClock(app->duration);
        return;
    }

    // Custom apps
    dma_display->clearScreen();

    // Background color
    if (app->backgroundColor != 0) {
        uint8_t br = (app->backgroundColor >> 16) & 0xFF;
        uint8_t bg = (app->backgroundColor >> 8) & 0xFF;
        uint8_t bb = app->backgroundColor & 0xFF;
        dma_display->fillScreen(dma_display->color565(br, bg, bb));
    }

    // Layout calculation - VERTICAL layout for 64x64 panel
    // +----------64px-----------+
    // |      Icon (8-16px)      |  <- centered, top
    // |                         |
    // |         Text            |  <- centered, below icon
    // |      (scrollable)       |
    // +-------------------------+

    int16_t textAreaX = 2;
    int16_t textAreaWidth = DISPLAY_WIDTH - 4;  // 2px margin each side
    int16_t textYPos = 28;  // Default Y position for text

    // Try to load icon if specified
    CachedIcon* icon = nullptr;
    if (strlen(app->icon) > 0) {
        icon = getIcon(app->icon);
    }

